{
  "name": "Vlad Vinogradov",
  "positions": [
    "Senior Software Developer"
  ],
  "limitations": "Require Visa Sponsorship",
  "contacts": [
    {
      "type": "mobile",
      "contact": "+31 (6) 57 47 72 18"
    },
    {
      "type": "email",
      "contact": "want.work.with.you@gmail.com"
    },
    {
      "type": "skype",
      "contact": "verwolf85"
    },
    {
      "type": "location",
      "contact": "Almere, Netherlands"
    }
  ],
  "links": [
    {
      "type": "LinkedIn",
      "link": "https://www.linkedin.com/in/vvv1559"
    },
    {
      "type": "GitHub",
      "link": "https://github.com/vvv1559"
    },
    {
      "type": "HackerRank",
      "link": "https://www.hackerrank.com/vvv1559"
    }
  ],
  "languages": [
    {
      "language": "English",
      "level": "Fluent"
    },
    {
      "language": "Russian",
      "level": "Native"
    },
    {
      "language": "Dutch",
      "level": "Beginner"
    }
  ],
  "summaries": [
    "Professional with more then 10 years of experience.",
    "Skilled to collaborate with colleagues across multiple business areas to ensure products align with requirements and expectations.",
    "Able to provide mentoring team members on best practices and technologies",
    "Communicable, with a keen responsibility sense and passion for self-education"
  ],
  "experience": [
    {
      "positions": [
        {
          "title": "Expert Software developer",
          "start": "2020-07",
          "end": null
        }
      ],
      "company": {
        "name": "Bol.com",
        "website": "https://bol.com",
        "location": "Utrecht"
      },
      "technologies": [
        "Java 11",
        "Kotlin",
        "Spring Boot",
        "Hibernate",
        "Mockito",
        "JUnit",
        "Maven",
        "Docker",
        "PostgreSQL",
        "Big Query",
        "Google cloud platform",
        "Jenkins",
        "GitLab",
        "Linux",
        "kubernetes",
        "Bash"
      ],
      "description": [
        "As a developer I was working on a high-loaded project (200 rps) to provide a set of the tools for maintaining selling offers on the bol.com web platform. This solution is heavily used by partners with accessing it by API, seller portal or by using FTP integrations",
        "As a volunteer I was taking a part in organising of internal technical conference with more than 600 participants."
      ]
    },
    {
      "positions": [
        {
          "title": "Software developer",
          "start": "2019-07",
          "end": "2020-06"
        }
      ],
      "company": {
        "name": "TripActions",
        "website": "https://tripactions.com",
        "location": "Amsterdam"
      },
      "technologies": [
        "Java 11",
        "Spring Boot",
        "Hibernate",
        "Mockito",
        "JUnit",
        "Maven",
        "Docker",
        "Apache Kafka",
        "MySql",
        "Jenkins",
        "Linux",
        "Bash"
      ],
      "description": [
        "As a developer, I analyzed and set up the architecture of a new solution for integration with a European trains provider. This helped our company significantly improve the coverage of train trips for our customers. As a result, we got an effective and scalable solution, with the highest test coverage in the company.",
        "As a developer, I analyzed and implemented the framework for the integration of company infrastructure with 3rd party HR management systems. Based on this framework my teammates were able to implement new integrations in a short period (a few days).",
        "As a team lead, I was working on the organisation of the development inside of the team: setting up the road map, defining priorities. As well, I helped my teammates with problems, questions and planning their professional grows."
      ]
    },
    {
      "positions": [
        {
          "title": "Middle Software Developer",
          "start": "2018-05",
          "end": "2018-12"
        },
        {
          "title": "Senior Software Developer",
          "start": "2018-12",
          "end": "2019-05"
        },
        {
          "title": "Development Team Lead",
          "start": "2019-05",
          "end": "2019-07"
        }
      ],
      "company": {
        "name": "Fuga Music",
        "website": "https://www.fuga.com",
        "location": "Amsterdam"
      },
      "technologies": [
        "Java 8",
        "Spring Boot",
        "Hibernate",
        "Mockito",
        "JUnit",
        "Maven",
        "Gradle",
        "Ruby",
        "Docker",
        "Apache Kafka",
        "MySql",
        "Google BigQuery",
        "JavaScript/React",
        "Jenkins",
        "Linux",
        "Bash"
      ],
      "description": [
        "Took a main part in the planning and development of a high loaded service (more than 160 million events per day), that is responsible for information retrieving from the streaming services such as Spotify, Apple, Google, Amazon and more.",
        "As a developer, I analyzed problems and implemented important changes to our processing tools. The current solution helps our customers to get information 100 times faster with 5 times fewer resources consumption.",
        "As a developer, I made refactoring of legacy code and tuned processing infrastructure. Those changes increased processing capacity at least 4 times."
      ]
    },
    {
      "positions": [
        {
          "title": "Software developer",
          "start": "2016-10",
          "end": "2018-05"
        }
      ],
      "company": {
        "name": "Yandex",
        "website": "https://www.yandex.com",
        "location": "Moscow"
      },
      "technologies": [
        "Java 8",
        "Spring Core",
        "Spring MVC",
        "Mockito",
        "JUnit",
        "React JS",
        "Python",
        "Apache ZooKeeper",
        "Docker",
        "MongoDB",
        "ClickHouse",
        "Oracle DB",
        "Gradle",
        "Maven",
        "Teamcity",
        "Linux",
        "Bash"
      ],
      "description": [
        "With a team, I took a part in the planning, support, optimization, and development of a high-loaded (500 thousand lines of logs per second, 1.5 million metrics per minute), geographically distributed complex of services, that is responsible for collecting, parsing the application's logs and building metrics based on this data. This service helps all teams of the company to watch and monitor states of applications, makes releases safer, gives tools for A/B tests monitoring and more.",
        "I took the main part in the collection of requirements and implementation of development tools to make the development and maintenance of application in a unified way. Also, they helped to make releases of new applications faster, reduced complexity of application maintenance and helped to create another toolset for setting up CI / CD processes with \"1-click\"",
        "With a team, I took part in the development of a complex of services for administrating applications and managing their CI / CD processes. I took the main part in the implementation of the subsystem for accounting components and resources. As well, I started a history of the common library of React components for our front-end part."
      ]
    },
    {
      "positions": [
        {
          "title": "Middle Engineer",
          "start": "2016-05",
          "end": "2016-10"
        }
      ],
      "company": {
        "name": "SberBank Technology",
        "website": "https://www.sber-tech.com",
        "location": "Moscow"
      },
      "technologies": [
        "Java 8",
        "Java EE",
        "Spring Core",
        "JUnit",
        "Maven",
        "Python",
        "Bash",
        "IBM WebSphere",
        "Oracle Linux",
        "Oracle DB",
        "Jenkins",
        "Teamcity"
      ],
      "description": [
        "I was a part of the development team. Our team was involved in the development of accounting service for trade acquiring."
      ]
    },
    {
      "positions": [
        {
          "title": "Engineer-programmer",
          "start": "2008-04",
          "end": "2012-08"
        },
        {
          "title": "Software Developer",
          "start": "2012-08",
          "end": "2013-04"
        },
        {
          "title": "Senior Software Developer",
          "start": "2013-04",
          "end": "2016-05"
        }
      ],
      "company": {
        "name": "Vimpelcom (Beeline)",
        "website": "www.veon.com",
        "location": "Moscow"
      },
      "technologies": [
        "1C: Enterprise 7.7, 8.2",
        "MS-SQL",
        "Oracle DB",
        "Windows Server 2003 – 2008"
      ],
      "description": [
        "In expert position, I was a part of the team for the development and support of the ERP-system for organizing and planning works, as well as accounting for material resources.",
        "Took a part in the planning, development, analysis of requirements as well as testing business logic. Worked in direct dialogue with key users and business customers.",
        "With team support I refactored the integration procedures in the T-SQL language, increasing their performance several times and reducing the number of errors. This helped to increase the efficiency of exchange between material and financial accounting systems."
      ]
    }
  ],
  "education": [
    {
      "start": "2014-11",
      "end": "2019-06",
      "description": "Bachelor of enginiering; Tula State University, Russia"
    },
    {
      "start": "1991-09",
      "end": "2001-07",
      "description": "High School #60; Tula, Russia"
    }
  ],
  "certification": [
    {
      "year": "2017",
      "description": "C++ White belt; The Complete React Native and Redux Course"
    },
    {
      "year": "2016",
      "description": "Algorithms and data structures; Web service development using Java (Level 1, 2); Functional programming using Haskell"
    },
    {
      "year": "2015",
      "description": "HTML5; Java SE"
    }
  ],
  "hobbies": [
    "Reading", "Running", "Listening to music", "Playing chess", "Cooking and baking", "Photography"
  ]
}